#include<Iostream>
using namespace std;

int main()
{
	int a, b;
	cout<<"國一時，渾渾噩噩的。\n";
	cout<<"對生活沒什麼幹勁，也對自己沒什麼自信。\n";
	cout<<"曾多次想尋死，卻也下不了手。\n";
	cout<<"升上了國二後，在老師的逼迫下，去考了市長盃，也順利進到了複賽與決賽。\n";
	cout<<"同年級一同進到決賽的只有一個男生，曾多次聽過他的名字卻不知道他是誰。\n";
	cout<<"因為好奇而想要去認識對方，但心裡卻總是猶豫不決。\n\n";
	cout<<"(1)這天，終於鼓起勇氣想要認識他。所以進教室後就開始尋找他的身影。\n";
	cout<<"(2)但因為對自己沒有自信，所以便做著原本自己應做的事，一切都與平常一樣。\n\n";
	cin>>a; 
	cout<<"\n\n";
	if(a==1)
	{
		cout<<"只可惜，進到決賽的同學並不只兩個，又由於不認識他，所以只能尋找學號與自己開頭相同的。\n";
		cout<<"但又哪是每個人都會把學號給你看?所以只能偷瞄，但因為怕被發現又不敢看太久。\n" ;
	}
	cout<<"就這樣子過了一陣子，即使無法認識他有點可惜，但自己也漸漸習慣了這種日常。\n";
	cout<<"直到某天，國三的學長姐們全去了畢業旅行。偌大的教室裡只剩下自己和他。\n";
	cout<<"命運的滾輪又再次開始轉動，只是跟上次不同，這次，倆人終於認識了。\n";
	cout<<"一見到他，自己便無可自拔的喜歡上了他。因為他喜歡上了數學，也因為他，生活又有了目標。\n";
	cout<<"知道自己配不上他，但，僅僅是從遠方看著，偶爾傳個訊息、問個問題便已是最大的奢求了。\n";
	cout<<"成為戀人甚麼的，可能要等下輩子吧。\n";
	cout<<"但依然很感謝他，因為他，國中生活染上了色彩，不再無聊，也不再毫無希望。\n";
	cout<<"他的名字，那簡簡單單的三個字，是心底最深處的溫柔。\n";
	cout<<"只要在夜晚無人之時，心中想著他，講出那句無聲的「月色真美。」\n";
	cout<<"如此，便足矣了。\n";
	cout<<"\n\n**THE END**\n" ;
}
